DataProcessors/ПростойИнтерфейсРазделСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПростойИнтерфейсРазделСотрудники</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВАрхиве</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗанятости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительныйЛист</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплатеДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплаченоДивиденды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоДоговоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплатеДоговоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплаченоДоговоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоловнаяОрганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоловнойСотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеРабочееМестоВОрганизации</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОформленПоТрудовомуДоговору</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОформленПоДоговоруПодряда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отступ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяДолжность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОрганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяТарифнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееПодразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийАванс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийПроцентСевернойНадбавки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийСпособРасчетаАванса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаАванса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УточнениеНаименования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиУчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьФорматОбменаЗУП25</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаниеДепонированныхСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервОтпусков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыплатыЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродолжительностьОтпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыплатыАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаАванса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗарплатаКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ЗарплатаКВыплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКВыплате</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеЗарплатыКВыплате</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ПростойИнтерфейсРазделСотрудники/Forms/Форма/Ext/Form/Module.bsl
#Область ОбъявлениеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		Элементы.ГруппаВариантыУчетаЗарплаты.ТекущаяСтраница = Элементы.СтраницаУчетЗарплатыИКадровВоВнешнейПрограмме;
		Возврат;
	КонецЕсли;
	
	ЭтоМедленныйРежимРаботы = ОбщегоНазначенияБП.ЭтоМедленныйРежимРаботы();
	ЭтоВебКлиент            = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
	
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	ТекущаяДатаРаботы = ТекущаяДатаСеанса();
	
	ПериодРегистрации = РасчетныйПериод(Организация, ТекущаяДатаРаботы);
	
	ПредставлениеПериодаРегистрации = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Перечисления.ДоступныеПериодыОтчета.Месяц, ПериодРегистрации, КонецМесяца(ПериодРегистрации));
	
	СпособВыплатыЗарплата = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СпособыВыплатыЗарплаты.Зарплата");
	СпособВыплатыАванс    = Справочники.СпособыВыплатыЗарплаты.НайтиПоРеквизиту("ХарактерВыплаты", Перечисления.ХарактерВыплатыЗарплаты.Аванс);
	
	ЭтоПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо") = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	РасчетЗарплатыДляНебольшихОрганизаций = ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций");
	Элементы.ГруппаКомандыДокументы.Видимость = РасчетЗарплатыДляНебольшихОрганизаций;
	Элементы.ДокументСправкаНДФЛ.Видимость = НЕ РасчетЗарплатыДляНебольшихОрганизаций;
	Элементы.СотрудникОформитьДоговорРаботыУслуги.Видимость = РасчетЗарплатыДляНебольшихОрганизаций;
	
	ИспользоватьКадровыйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет");
	ИспользоватьНачисленияПоДоговорам = ПолучитьФункциональнуюОпцию("ИспользоватьНачисленияПоДоговорам");
	
	УстановитьУсловноеОформление();
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		УправлениеФормой(ЭтотОбъект);
	Иначе
		ПустойСписок = ПустойСписок(Организация);
		Если ПустойСписок Тогда
			УправлениеФормой(ЭтотОбъект);
		Иначе
			Если НЕ ЭтоМедленныйРежимРаботы И НЕ ЭтоВебКлиент Тогда
				ПолучитьДанныеРазделаНаСервере();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтаФорма,
		"БП.Обработка.ПростойИнтерфейсРазделСотрудники",
		"Форма",
		НСтр("ru='Новости: Сотрудники'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	
	СкрыватьПомеченныеНаУдаление = ПомеченныеНаУдаление.СкрыватьПомеченныеНаУдаление();
	ОтслеживатьПометкуУдаления = ПомеченныеНаУдаление.ОтслеживатьПометкуУдаления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Организация) 
		И НЕ ПустойСписок Тогда
		
		Если ЭтоМедленныйРежимРаботы ИЛИ ЭтоВебКлиент Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьДанныеРаздела",0.5, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтаФорма);
	// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	ТекущийСотрудник = Неопределено;
	Если СтрокаТаблицы <> Неопределено Тогда
		ТекущийСотрудник = СтрокаТаблицы.Ссылка;
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменениеДанныхМестаРаботы" Тогда
		
		ПолучитьДанныеРаздела(Параметр);
		
	ИначеЕсли ИмяСобытия = "СозданСотрудник"
		ИЛИ ИмяСобытия = "Запись_Сотрудники" Тогда
		
		ПолучитьДанныеРаздела(Параметр);
		
		Если ПустойСписок Тогда
			ПустойСписок = Ложь;
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_НачислениеЗарплаты"
		ИЛИ ИмяСобытия = "Запись_БольничныйЛист"
		ИЛИ ИмяСобытия = "Запись_Отпуск"
		ИЛИ ИмяСобытия = "Запись_ВедомостьНаВыплатуЗарплатыВБанк"
		ИЛИ ИмяСобытия = "Запись_ВедомостьНаВыплатуЗарплатыВКассу"
		ИЛИ ИмяСобытия = "Запись_ПриемНаРаботу"
		ИЛИ ИмяСобытия = "Запись_КадровыйПеревод"
		ИЛИ ИмяСобытия = "Запись_Увольнение" Тогда
		
		ПолучитьДанныеРаздела(Источник);
		
	ИначеЕсли ИмяСобытия = "Запись_НачислениеДивидендов"
		ИЛИ ИмяСобытия = "Запись_ДоговорРаботыУслуги" Тогда
		
		ПолучитьДанныеРаздела();
		
	ИначеЕсли ИмяСобытия = "Запись_СписаниеСРасчетногоСчета"
		ИЛИ ИмяСобытия = "Запись_РасходныйКассовыйОрдер" 
		ИЛИ ИмяСобытия = "ОбновитьФорму" Тогда
		
		Если ТребуетсяПолучитьДанныеОплаты(Источник) Тогда
			ПолучитьДанныеРаздела();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗарплатаРассчитана_ПомощникУчетаЗарплаты" Тогда
		Если Параметр.Организация = Организация Тогда
			ПолучитьДанныеРаздела();
		КонецЕсли;
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ПерсонализированныеПредложенияСервисовКлиент.ПерейтиПоСсылкеБаннера(
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Баннер, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	ПолучитьДанныеРаздела();
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; // Незачем очищать
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", ПериодРегистрации, КонецМесяца(ПериодРегистрации));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, Элементы.ПредставлениеПериодаРегистрации, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	Если ПериодРегистрации > ТекущаяДатаРаботы Тогда
		ТекущаяДатаРаботы = ПериодРегистрации;
	КонецЕсли;
	
	// Обновляем представление периода на форме.
	ПредставлениеПериодаРегистрации = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"),
		ПериодРегистрации,
		КонецМесяца(ПериодРегистрации));
		
	ПолучитьДанныеРаздела();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПриемНаРаботуНажатие(Элемент)
	
	СоздатьДокументПриемНаРаботу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОформитьДоговорНажатие(Элемент)
	
	ОткрытьФорму("Документ.ДоговорРаботыУслуги.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.Интерфейс");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВидНачисленияЗарплата"
		ИЛИ Поле.Имя = "Начислено"
		ИЛИ Поле.Имя = "Удержано"
		ИЛИ Поле.Имя = "Выплачено"
		ИЛИ Поле.Имя = "КВыплате"
		ИЛИ Поле.Имя = "НачисленоДоговоры" Тогда
		ОткрытьРасчетныйДокумент("НачислениеЗарплаты");
	ИначеЕсли Поле.Имя = "ВидНачисленияДивиденды"
		ИЛИ Поле.Имя = "НачисленоДивиденды"
		ИЛИ Поле.Имя = "НДФЛДивиденды"
		ИЛИ Поле.Имя = "ВыплаченоДивиденды"
		ИЛИ Поле.Имя = "КВыплатеДивиденды" Тогда
		ОткрытьРасчетныйДокумент("НачислениеДивидендов");
	Иначе
		ОткрытьКарточкуСотрудника();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	ПериодРегистрации = ДобавитьМесяц(ПериодРегистрации,-1);
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	ПериодРегистрации = ДобавитьМесяц(ПериодРегистрации, 1);
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗарплаты(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",      Организация);
	ПараметрыФормы.Вставить("ПериодСобытия",    ПериодРегистрации);
	ПараметрыФормы.Вставить("Правило",          "");
	
	ОткрытьФорму("Обработка.ПомощникУчетаЗарплаты.Форма.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатитьАванс(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",      Организация);
	ПараметрыФормы.Вставить("ПериодСобытия",    ПериодРегистрации);
	ПараметрыФормы.Вставить("Аванс",            Истина);
	ПараметрыФормы.Вставить("Правило",          "");
	
	ОткрытьФорму("Обработка.ПомощникУчетаЗарплаты.Форма.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтрокаТаблицы.Работает Тогда
		
		ТекущийМесяц = Месяц(ПериодРегистрации);
		
		ТекстГод   = Прав(ПредставлениеПериодаРегистрации,4);
		ТекстМесяц = Лев(ПредставлениеПериодаРегистрации,
			СтрДлина(ПредставлениеПериодаРегистрации)-?(ТекущийМесяц = 3 ИЛИ ТекущийМесяц = 8,5,6));
		ТекстМесяц = СтрШаблон(НСтр("ru = '%1е'"), ТекстМесяц);
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сотрудник ""%1"" не работает в организации в %2 %3 г.'"),
			СтрокаТаблицы.Наименование,
			ТекстМесяц,
			ТекстГод);
	Иначе
		
		Если НЕ(Команда.Имя = "ДокументСправкаНДФЛ" ИЛИ Команда.Имя = "ДокументИсполнительныйЛист") Тогда
			ПараметрыДокумента = Новый Структура("Организация, ПериодРегистрации, Сотрудник", 
												Организация, НачалоМесяца(ПериодРегистрации), СтрокаТаблицы.Ссылка);
			ЗначенияЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыДокумента);
		Иначе
			ЗначенияЗаполнения = Новый Структура("Основание", СтрокаТаблицы.Ссылка);
		КонецЕсли;
		
		ОткрытьФорму("Документ." + СтрЗаменить(Команда.Имя, "Документ","") + ".ФормаОбъекта",
			ЗначенияЗаполнения,
			ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриемНаРаботу(Команда)
	
	СоздатьДокументПриемНаРаботу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКадровыйПеревод(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьКадровыйУчет Тогда
		СотрудникиКлиент.ОформитьНаОсновании(ЭтаФорма, СтрокаТаблицы.Ссылка, "Документ." + СтрЗаменить(Команда.Имя, "Документ",""));
	Иначе
		ПараметрыСотрудника = Новый Структура("Ключ", СтрокаТаблицы.Ссылка);
		ФормаСотрудника = ПолучитьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыСотрудника);
		ФормаСотрудника.ТекущийЭлемент = ФормаСотрудника.Элементы.ТекущаяТарифнаяСтавка;
		ФормаСотрудника.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУвольнение(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьКадровыйУчет Тогда
		СотрудникиКлиент.ОформитьНаОсновании(ЭтаФорма, СтрокаТаблицы.Ссылка, "Документ." + СтрЗаменить(Команда.Имя, "Документ",""));
	Иначе
		ПараметрыСотрудника = Новый Структура("Ключ", СтрокаТаблицы.Ссылка);
		ФормаСотрудника = ПолучитьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыСотрудника);
		ФормаСотрудника.Элементы.ДатаУвольнения.Видимость = Истина;
		ФормаСотрудника.Элементы.Уволить.Видимость        = Ложь;
		ФормаСотрудника.ТекущийЭлемент = ФормаСотрудника.Элементы.ДатаУвольнения;
		ФормаСотрудника.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНачислениеДивидендов(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДокумента = ?(КонецМесяца(ТекущаяДата()) = КонецМесяца(ПериодРегистрации),
		ТекущаяДата(),
		КонецМесяца(ПериодРегистрации));
		
	ПараметрыДокумента = Новый Структура("Организация, Дата, Учредитель", 
										Организация, ДатаДокумента, СтрокаТаблицы.ФизическоеЛицо);
	ЗначенияЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыДокумента);
		
	ОткрытьФорму("Документ.НачислениеДивидендов.ФормаОбъекта",
		ЗначенияЗаполнения,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументДоговорРаботыУслуги(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиКлиент.ОформитьНаОсновании(ЭтаФорма, СтрокаТаблицы.Ссылка, "Документ." + СтрЗаменить(Команда.Имя, "Документ",""));
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьДокументДоговорРаботыУслуги(Команда)
	
	ОткрытьФорму("Документ.ДоговорРаботыУслуги.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетТ2(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(СтрокаТаблицы.Ссылка);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Сотрудники",
		"ПФ_MXL_Т2",
		МассивСотрудников,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВзаиморасчеты(Команда)
	
	Вариант = ПолучитьВариантОтчета("АнализНачисленийИУдержаний", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНДФЛ(Команда)
	
	Вариант = ПолучитьВариантОтчета("АнализНДФЛ", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтраховыеВзносы(Команда)
	
	Вариант = ПолучитьВариантОтчета("АнализВзносовВФонды", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСотрудники(Команда)
	
	Вариант = ПолучитьВариантОтчета("ОтчетыПоСотрудникам", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНалогиИВзносыКратко(Команда)
	
	Вариант = ПолучитьВариантОтчета("НалогиИВзносыКратко", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетТ13(Команда)
	
	Вариант = ПолучитьВариантОтчета("УнифицированнаяФормаТ13", СтрЗаменить(Команда.Имя, "Отчет",""));
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтотОбъект, Вариант);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАнализРасходовНаОплатуТруда(Команда)
	
	ОткрытьФорму("Отчет.АнализРасходовНаОплатуТруда.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаСотрудника(Команда)
	
	ОткрытьКарточкуСотрудника();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаления(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОСотруднике = Новый Структура("Ссылка, ДатаПриема, ДатаУвольнения, ДатаРождения, Работает, Картинка, ПометкаУдаления");
	ЗаполнитьЗначенияСвойств(СведенияОСотруднике, СтрокаТаблицы);
	
	УстановитьСнятьПометкуУдаления(СведенияОСотруднике);
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СведенияОСотруднике, "Работает, Картинка, ПометкаУдаления");
	Объект.Список.Сортировать("Работает Убыв, ПометкаУдаления Возр, Наименование Возр");
	
	Если СкрыватьПомеченныеНаУдаление Тогда
		ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элементы.Список);
		ПолучитьДанныеРаздела();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ПолучитьДанныеРаздела();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтекстныеНовости(Команда)

	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаКомандыНовости(
		ЭтаФорма,
		Команда
	);

КонецПроцедуры

// Процедура показывает новости, требующие прочтения (важные и очень важные)
//
// Параметры:
//  Нет
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	// ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	// Конец ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии

	ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтаФорма, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ЗакрытьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьПредыдущийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//Оформление таблицы Список
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Список");
	ГруппаИли = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы,
		"ПризнакРаботника",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"Объект.Список.Работает", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"Объект.Список.ПометкаУдаления", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВидНачисленияЗарплата");
	ГруппаРасчетыИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы,
		"ПризнакРасчетов",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаРасчетыИ,
		"Объект.Список.НачисленоДивиденды", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаРасчетыИ,
		"Объект.Список.КВыплатеДивиденды", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаРасчетыИ,
		"Объект.Список.НачисленоДоговоры", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаРасчетыИ,
		"Объект.Список.КВыплатеДоговоры", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВидНачисленияДивиденды");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленоДивиденды");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НДФЛДивиденды");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыплаченоДивиденды");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КВыплатеДивиденды");
	ГруппаДивидендыИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы,
		"ПризнакДивиденды",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаДивидендыИ,
		"Объект.Список.НачисленоДивиденды", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаДивидендыИ,
		"Объект.Список.КВыплатеДивиденды", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВидНачисленияДоговоры");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленоДоговоры");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыплаченоДоговоры");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КВыплатеДоговоры");
	ГруппаДоговорникиИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы,
		"ПризнакДоговорники",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаДоговорникиИ,
		"Объект.Список.НачисленоДоговоры", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаДоговорникиИ,
		"Объект.Список.КВыплатеДоговоры", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Если НЕ ЗначениеЗаполнено(Форма.Организация) Тогда
		Форма.Элементы.ГруппаСписокСотрудников.ТекущаяСтраница = Форма.Элементы.СтраницаНеВыбранаОрганизация;
		Форма.Элементы.ГруппаКоманднаяПанель.Доступность = Ложь;
	ИначеЕсли Форма.ПустойСписок Тогда
		Форма.Элементы.ГруппаСписокСотрудников.ТекущаяСтраница = Форма.Элементы.СтраницаПустая;
		Форма.Элементы.ГруппаКоманднаяПанель.Доступность = Ложь;
		Форма.Элементы.ДекорацияИли.Видимость = Форма.ИспользоватьНачисленияПоДоговорам;
		Форма.Элементы.ДекорацияОформитьДоговор.Видимость = Форма.ИспользоватьНачисленияПоДоговорам;
	Иначе
		Форма.Элементы.ГруппаСписокСотрудников.ТекущаяСтраница = Форма.Элементы.СтраницаСписок;
		Форма.Элементы.ГруппаКоманднаяПанель.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки();

	Для каждого Строка ИЗ Объект.Список Цикл
		Строка.ВидНачисленияЗарплата  = НСтр("ru = 'зарплата:'");
		Строка.ВидНачисленияДивиденды = НСтр("ru = 'дивиденды:'");
		Строка.ВидНачисленияДоговоры  = НСтр("ru = 'договоры подряда:'");
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоги()
	
	ИтогоНачислено = Объект.Список.Итог("Начислено")
		+ Объект.Список.Итог("НачисленоДивиденды")
		+ Объект.Список.Итог("НачисленоДоговоры");
	ИтогоУдержано  = Объект.Список.Итог("Удержано")
		+ Объект.Список.Итог("НДФЛДивиденды");
	ИтогоВыплачено = Объект.Список.Итог("Выплачено")
		+ Объект.Список.Итог("ВыплаченоДивиденды")
		+ Объект.Список.Итог("ВыплаченоДоговоры");
	ИтогоКВыплате  = Объект.Список.Итог("КВыплате")
		+ Объект.Список.Итог("КВыплатеДивиденды")
		+ Объект.Список.Итог("КВыплатеДоговоры");
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЭтоПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо") = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	ПустойСписок = ПустойСписок(Организация);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПустойСписок(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ГоловнаяОрганизация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции

&НаСервере
Функция ВыполнитьПолучениеДанныхНаСервере(Параметр = Неопределено)
	
	ПараметрыОбработки = СформироватьПараметрыОбработки(Параметр);
	
	НаименованиеЗадания = НСтр("ru = 'Раздел ""Сотрудники"": получение данных'");
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"Обработки.ПростойИнтерфейсРазделСотрудники.ПодготовитьДанные", 
			ПараметрыОбработки, 
			НаименованиеЗадания);
			
		АдресХранилища = Результат.АдресХранилища;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьРезультат()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ОбновитьВесьСписок  = Ложь;
		ОбновитьСотрудников = Ложь;
		Результат.Свойство("ОбновитьВесьСписок",  ОбновитьВесьСписок);
		Результат.Свойство("ОбновитьСотрудников", ОбновитьСотрудников);
		
		Если ОбновитьВесьСписок ИЛИ ОбновитьСотрудников Тогда
			
			Если Результат.Свойство("Список") Тогда
				Если ТипЗнч(Результат.Список) = Тип("ТаблицаЗначений") Тогда
					
					Если ОбновитьВесьСписок Тогда
						Объект.Список.Очистить();
						Объект.Список.Загрузить(Результат.Список);
					КонецЕсли;
					
					Если ОбновитьСотрудников Тогда
						ОбновитьДанныеСотрудников(Результат.Список);
					КонецЕсли;
					
					Если Объект.Список.Итог("ИсполнительныйЛист")<> 0 Тогда
						Элементы.Удержано.Заголовок = НСтр("ru = 'НДФЛ и алименты'");
					Иначе
						Элементы.Удержано.Заголовок = НСтр("ru = 'НДФЛ'");
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьДобавленныеКолонки();
	ЗаполнитьИтоги();
	Элементы.ГруппаНачисленоВидНачисления.Видимость =
		Объект.Список.Итог("НачисленоДивиденды") <> 0
		ИЛИ Объект.Список.Итог("КВыплатеДивиденды") <> 0
		ИЛИ Объект.Список.Итог("НачисленоДоговоры") <> 0
		ИЛИ Объект.Список.Итог("КВыплатеДоговоры") <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьДанныеРаздела()
	
	ПолучитьДанныеРаздела();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеРаздела(Параметр = Неопределено)
	
	Результат = ВыполнитьПолучениеДанныхНаСервере(Параметр);
	
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	Иначе
		ЗагрузитьРезультат();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеРазделаНаСервере()
	
	ПараметрыОбработки = СформироватьПараметрыОбработки();
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Обработки.ПростойИнтерфейсРазделСотрудники.ПодготовитьДанные(ПараметрыОбработки, АдресХранилища);
	ЗагрузитьРезультат();
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяПолучитьДанныеОплаты(Источник)
	
	Если ТипЗнч(Источник) <> Тип("ДокументСсылка.СписаниеСРасчетногоСчета")
		И ТипЗнч(Источник) <> Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, ВидОперации");
	
	Если РеквизитыДокумента.Организация = ЭтотОбъект.Организация Тогда
		Если РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаДивидендов
			ИЛИ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям
			ИЛИ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику
			ИЛИ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДивидендов
			ИЛИ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП
			ИЛИ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику Тогда
			
			Возврат Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеСотрудников(ТаблицаДаных)
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаДаных Цикл
		
		МассивСтрок = Объект.Список.НайтиСтроки(Новый Структура("Ссылка", СтрокаТаблицы.Ссылка));
		Если МассивСтрок.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(МассивСтрок[0], СтрокаТаблицы);
		Иначе
			НоваяСтрока = Объект.Список.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			Объект.Список.Сортировать("Работает Убыв, ПометкаУдаления Возр, Наименование Возр");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодРегистрации = РезультатВыбора.НачалоПериода;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРасчетныйДокументЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", РезультатВыбора.Значение);
	ОткрытьФорму("Документ." + ДополнительныеПараметры.ТипРасчета + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПриемНаРаботу()
	
	Если ИспользоватьКадровыйУчет Тогда
		ОткрытьФорму("Документ.ПриемНаРаботу.Форма.ФормаДокумента");
	Иначе
		ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВариантОтчета(ИмяОтчета, ИмяВарианта)
	
	Отчет         = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ИмяОтчета);
	ВариантОтчета = ВариантыОтчетов.ВариантОтчета(Отчет, ИмяВарианта);
	Возврат ВариантОтчета;
	
КонецФункции

&НаКлиенте
Процедура ОтчетДругиеОтчеты(Команда)
	
	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов(
		"Отчеты.Сотрудники", 
		Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуСотрудника()
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "ОткрытиеФормыЭлементаСправочникаСотрудники");
	
	ПараметрыФормы = Новый Структура("Ключ", СтрокаТаблицы.Ссылка);
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасчетныйДокумент(ТипРасчета)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасчетныйДокумент = РасчетныйДокументНаСервере(СтрокаТаблицы.Ссылка, ТипРасчета);
	Если РасчетныйДокумент <> Неопределено Тогда
		Если ТипЗнч(РасчетныйДокумент) = Тип("СписокЗначений") Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьРасчетныйДокументЗавершение", ЭтотОбъект, Новый Структура("ТипРасчета", ТипРасчета));
			ПоказатьВыборИзМеню(ОписаниеОповещения, РасчетныйДокумент);
		Иначе
			ПараметрыФормы = Новый Структура("Ключ", РасчетныйДокумент);
			ОткрытьФорму("Документ." + ТипРасчета + ".ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РасчетныйДокументНаСервере(Сотрудник, ТипРасчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",             Организация);
	Запрос.УстановитьПараметр("Сотрудник",               Сотрудник);
	Запрос.УстановитьПараметр("ФизическоеЛицо",          ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо"));
	Запрос.УстановитьПараметр("ПериодРегистрацииНачало", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПериодРегистрацииКонец",  КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Зарплата",                ТипРасчета = "НачислениеЗарплаты");
	Запрос.УстановитьПараметр("Дивиденды",               ТипРасчета = "НачислениеДивидендов");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплатыСотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты.Сотрудники КАК НачислениеЗарплатыСотрудники
	|ГДЕ
	|	НачислениеЗарплатыСотрудники.Ссылка.Организация = &Организация
	|	И НачислениеЗарплатыСотрудники.Ссылка.Проведен
	|	И НачислениеЗарплатыСотрудники.Сотрудник = &Сотрудник
	|	И НачислениеЗарплатыСотрудники.Ссылка.МесяцНачисления МЕЖДУ &ПериодРегистрацииНачало И &ПериодРегистрацииКонец
	|	И &Зарплата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеДивидендов.Ссылка
	|ИЗ
	|	Документ.НачислениеДивидендов КАК НачислениеДивидендов
	|ГДЕ
	|	НачислениеДивидендов.Организация = &Организация
	|	И НачислениеДивидендов.Проведен
	|	И НачислениеДивидендов.ТипУчредителя = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|	И НачислениеДивидендов.Учредитель = &ФизическоеЛицо
	|	И НачислениеДивидендов.Дата МЕЖДУ &ПериодРегистрацииНачало И &ПериодРегистрацииКонец
	|	И &Дивиденды";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		СписокДокументов = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СписокДокументов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Возврат СписокДокументов;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьСнятьПометкуУдаления(СведенияОСотруднике)
	
	СотрудникОбъект = СведенияОСотруднике.Ссылка.ПолучитьОбъект();
	СотрудникОбъект.УстановитьПометкуУдаления(НЕ СотрудникОбъект.ПометкаУдаления);
	
	СведенияОСотруднике.ПометкаУдаления = СотрудникОбъект.ПометкаУдаления;
	
	Обработки.ПростойИнтерфейсРазделСотрудники.УстановитьСтатусСотрудника(СведенияОСотруднике, ПериодРегистрации);
	
КонецПроцедуры

Функция РасчетныйПериод(Организация, ТекущаяДатаРаботы);
	
	ТекущийПериод       = НачалоМесяца(ТекущаяДатаРаботы);
	ПериодЗадолженности = ТекущийПериод;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		НастройкиУчетаЗарплаты = РегистрыСведений.НастройкиУчетаЗарплаты.СоздатьМенеджерЗаписи();
		НастройкиУчетаЗарплаты.Организация = Организация;
		НастройкиУчетаЗарплаты.Прочитать();
		ДатаВыплатыЗарплаты = НастройкиУчетаЗарплаты.ДатаВыплатыЗарплаты;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ЗарплатаКВыплате.Остатки(, Организация = &Организация) КАК ЗарплатаКВыплатеОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВзаиморасчетов";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПериодЗадолженности = НачалоМесяца(Выборка.ПериодВзаиморасчетов);
		КонецЕсли;
	Иначе
		ДатаВыплатыЗарплаты = День(ТекущаяДатаРаботы);
	КонецЕсли;
	
	Если ПериодЗадолженности < ТекущийПериод Тогда
		РасчетныйПериод = ПериодЗадолженности;
	Иначе
		Если ДатаВыплатыЗарплаты >= День(ТекущаяДатаРаботы) Тогда
			РасчетныйПериод = НачалоМесяца(ДобавитьМесяц(ТекущийПериод, -1));
		Иначе
			РасчетныйПериод = ТекущийПериод;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РасчетныйПериод;
	
КонецФункции

#Область ДлительныеОперации

&НаСервере
Функция СформироватьПараметрыОбработки(Параметр = Неопределено)
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("Организация",             Организация);
	ПараметрыОбработки.Вставить("ПериодРегистрации",       ПериодРегистрации);
	ПараметрыОбработки.Вставить("ТекущаяДатаРаботы",       ТекущаяДатаРаботы);
	ПараметрыОбработки.Вставить("Параметр",                Параметр);
	
	Возврат ПараметрыОбработки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ЗагрузитьРезультат();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания", 
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
					Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Баннер

&НаКлиенте
Процедура Подключаемый_УстановитьБаннер()
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьСледующийБаннер()
	
	// Поскольку обработчик может вызываться не только интерактивно пользователем,
	// но и автоматически по таймеру, меняем баннер при условии, что форма находится в фокусе.
	Если НЕ ВводДоступен() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
		Возврат;
	КонецЕсли;
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьПредыдущийБаннер()
	
	УстановитьБаннер(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБаннер(ПоказатьПредыдущий = Ложь)
	
	ДлительнаяОперация = ПолучитьБаннерНаСервере(ПоказатьПредыдущий);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("ПослеПолученияБаннераВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияБаннераВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		УстановитьБаннерНаФорме(ДлительнаяОперация.АдресРезультата);
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаннерНаСервере(ПоказатьПредыдущий)
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение баннера в фоне'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("Размещение", ПерсонализированныеПредложенияСервисов.ИмяРазмещенияПростойИнтерфейсРазделСотрудники());
	СтруктураПараметров.Вставить("ПоказатьПредыдущий", ПоказатьПредыдущий);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ПерсонализированныеПредложенияСервисов.ПолучитьБаннер",
		СтруктураПараметров,
		НастройкиЗапуска);
	
КонецФункции

&НаСервере
Процедура УстановитьБаннерНаФорме(АдресРезультата)
	
	ПерсонализированныеПредложенияСервисов.УстановитьБаннерНаФорме(ЭтотОбъект, АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьБаннер()
	
	ПерсонализированныеПредложенияСервисов.ЗакрытьБаннер(ЭтотОбъект, Организация);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
